name: "ResNet-101-gtc"
layer {
    name: "data"
    type: "Data"
    top: "data"
    top: "label"
    include {
        phase: TRAIN
    }
    transform_param {
        mirror: true
        crop_size: 224
	mean_file: "/home/xiangye/test_StanfordCars-python/lmdb/imagenet_mean.binaryproto"
        #mean_value: 104
        #mean_value: 117
        #mean_value: 123
    }
    data_param {
        source: "/home/xiangye/test_StanfordCars-python/lmdb/train_data_lmdb"
        #batch_size: 32
	batch_size: 18
        backend: LMDB
    }
}
layer {
    name: "data"
    type: "Data"
    top: "data"
    top: "label"
    include {
        phase: TEST
    }
    transform_param {
        mirror: false
        crop_size: 224
        mean_file: "/home/xiangye/test_StanfordCars-python/lmdb/imagenet_mean.binaryproto"
        #mean_value: 104
        #mean_value: 117
        #mean_value: 123
    }
    data_param {
        source: "/home/xiangye/test_StanfordCars-python/lmdb/test_data_lmdb"
        batch_size: 2
        backend: LMDB
    }
}

layer {
    bottom: "data"
    top: "conv1"
    name: "conv1"
    type: "Convolution"
    convolution_param {
        num_output: 64
        kernel_size: 7
        pad: 3
        stride: 2
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "conv1"
    top: "conv1"
    name: "bn_conv1"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "conv1"
    top: "conv1"
    name: "scale_conv1"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "conv1"
    top: "conv1"
    name: "conv1_relu"
    type: "ReLU"
}

layer {
    bottom: "conv1"
    top: "pool1"
    name: "pool1"
    type: "Pooling"
    pooling_param {
        kernel_size: 3
        stride: 2
        pool: MAX
    }
}

layer {
    bottom: "pool1"
    top: "res2a_branch1"
    name: "res2a_branch1"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2a_branch1"
    top: "res2a_branch1"
    name: "bn2a_branch1"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2a_branch1"
    top: "res2a_branch1"
    name: "scale2a_branch1"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "pool1"
    top: "res2a_branch2a"
    name: "res2a_branch2a"
    type: "Convolution"
    convolution_param {
        num_output: 64
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2a_branch2a"
    top: "res2a_branch2a"
    name: "bn2a_branch2a"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2a_branch2a"
    top: "res2a_branch2a"
    name: "scale2a_branch2a"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2a_branch2a"
    top: "res2a_branch2a"
    name: "res2a_branch2a_relu"
    type: "ReLU"
}

layer {
    bottom: "res2a_branch2a"
    top: "res2a_branch2b"
    name: "res2a_branch2b"
    type: "Convolution"
    convolution_param {
        num_output: 64
        kernel_size: 3
        pad: 1
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2a_branch2b"
    top: "res2a_branch2b"
    name: "bn2a_branch2b"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2a_branch2b"
    top: "res2a_branch2b"
    name: "scale2a_branch2b"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2a_branch2b"
    top: "res2a_branch2b"
    name: "res2a_branch2b_relu"
    type: "ReLU"
}

layer {
    bottom: "res2a_branch2b"
    top: "res2a_branch2c"
    name: "res2a_branch2c"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2a_branch2c"
    top: "res2a_branch2c"
    name: "bn2a_branch2c"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2a_branch2c"
    top: "res2a_branch2c"
    name: "scale2a_branch2c"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2a_branch1"
    bottom: "res2a_branch2c"
    top: "res2a"
    name: "res2a"
    type: "Eltwise"
    eltwise_param {
        operation: SUM
    }
}

layer {
    bottom: "res2a"
    top: "res2a"
    name: "res2a_relu"
    type: "ReLU"
}

layer {
    bottom: "res2a"
    top: "res2b_branch2a"
    name: "res2b_branch2a"
    type: "Convolution"
    convolution_param {
        num_output: 64
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2b_branch2a"
    top: "res2b_branch2a"
    name: "bn2b_branch2a"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2b_branch2a"
    top: "res2b_branch2a"
    name: "scale2b_branch2a"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2b_branch2a"
    top: "res2b_branch2a"
    name: "res2b_branch2a_relu"
    type: "ReLU"
}

layer {
    bottom: "res2b_branch2a"
    top: "res2b_branch2b"
    name: "res2b_branch2b"
    type: "Convolution"
    convolution_param {
        num_output: 64
        kernel_size: 3
        pad: 1
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2b_branch2b"
    top: "res2b_branch2b"
    name: "bn2b_branch2b"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2b_branch2b"
    top: "res2b_branch2b"
    name: "scale2b_branch2b"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2b_branch2b"
    top: "res2b_branch2b"
    name: "res2b_branch2b_relu"
    type: "ReLU"
}

layer {
    bottom: "res2b_branch2b"
    top: "res2b_branch2c"
    name: "res2b_branch2c"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2b_branch2c"
    top: "res2b_branch2c"
    name: "bn2b_branch2c"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2b_branch2c"
    top: "res2b_branch2c"
    name: "scale2b_branch2c"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2a"
    bottom: "res2b_branch2c"
    top: "res2b"
    name: "res2b"
    type: "Eltwise"
    eltwise_param {
        operation: SUM
    }
}

layer {
    bottom: "res2b"
    top: "res2b"
    name: "res2b_relu"
    type: "ReLU"
}

layer {
    bottom: "res2b"
    top: "res2c_branch2a"
    name: "res2c_branch2a"
    type: "Convolution"
    convolution_param {
        num_output: 64
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2c_branch2a"
    top: "res2c_branch2a"
    name: "bn2c_branch2a"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2c_branch2a"
    top: "res2c_branch2a"
    name: "scale2c_branch2a"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2c_branch2a"
    top: "res2c_branch2a"
    name: "res2c_branch2a_relu"
    type: "ReLU"
}

layer {
    bottom: "res2c_branch2a"
    top: "res2c_branch2b"
    name: "res2c_branch2b"
    type: "Convolution"
    convolution_param {
        num_output: 64
        kernel_size: 3
        pad: 1
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2c_branch2b"
    top: "res2c_branch2b"
    name: "bn2c_branch2b"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2c_branch2b"
    top: "res2c_branch2b"
    name: "scale2c_branch2b"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2c_branch2b"
    top: "res2c_branch2b"
    name: "res2c_branch2b_relu"
    type: "ReLU"
}

layer {
    bottom: "res2c_branch2b"
    top: "res2c_branch2c"
    name: "res2c_branch2c"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2c_branch2c"
    top: "res2c_branch2c"
    name: "bn2c_branch2c"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2c_branch2c"
    top: "res2c_branch2c"
    name: "scale2c_branch2c"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2b"
    bottom: "res2c_branch2c"
    top: "res2c"
    name: "res2c"
    type: "Eltwise"
    eltwise_param {
        operation: SUM
    }
}

layer {
    bottom: "res2c"
    top: "res2c"
    name: "res2c_relu"
    type: "ReLU"
}

layer {
    bottom: "res2c"
    top: "res3a_branch1"
    name: "res3a_branch1"
    type: "Convolution"
    convolution_param {
        num_output: 512
        kernel_size: 1
        pad: 0
        stride: 2
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3a_branch1"
    top: "res3a_branch1"
    name: "bn3a_branch1"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3a_branch1"
    top: "res3a_branch1"
    name: "scale3a_branch1"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res2c"
    top: "res3a_branch2a"
    name: "res3a_branch2a"
    type: "Convolution"
    convolution_param {
        num_output: 128
        kernel_size: 1
        pad: 0
        stride: 2
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3a_branch2a"
    top: "res3a_branch2a"
    name: "bn3a_branch2a"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3a_branch2a"
    top: "res3a_branch2a"
    name: "scale3a_branch2a"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3a_branch2a"
    top: "res3a_branch2a"
    name: "res3a_branch2a_relu"
    type: "ReLU"
}

layer {
    bottom: "res3a_branch2a"
    top: "res3a_branch2b"
    name: "res3a_branch2b"
    type: "Convolution"
    convolution_param {
        num_output: 128
        kernel_size: 3
        pad: 1
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3a_branch2b"
    top: "res3a_branch2b"
    name: "bn3a_branch2b"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3a_branch2b"
    top: "res3a_branch2b"
    name: "scale3a_branch2b"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3a_branch2b"
    top: "res3a_branch2b"
    name: "res3a_branch2b_relu"
    type: "ReLU"
}

layer {
    bottom: "res3a_branch2b"
    top: "res3a_branch2c"
    name: "res3a_branch2c"
    type: "Convolution"
    convolution_param {
        num_output: 512
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3a_branch2c"
    top: "res3a_branch2c"
    name: "bn3a_branch2c"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3a_branch2c"
    top: "res3a_branch2c"
    name: "scale3a_branch2c"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3a_branch1"
    bottom: "res3a_branch2c"
    top: "res3a"
    name: "res3a"
    type: "Eltwise"
    eltwise_param {
        operation: SUM
    }
}

layer {
    bottom: "res3a"
    top: "res3a"
    name: "res3a_relu"
    type: "ReLU"
}

layer {
    bottom: "res3a"
    top: "res3b1_branch2a"
    name: "res3b1_branch2a"
    type: "Convolution"
    convolution_param {
        num_output: 128
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b1_branch2a"
    top: "res3b1_branch2a"
    name: "bn3b1_branch2a"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b1_branch2a"
    top: "res3b1_branch2a"
    name: "scale3b1_branch2a"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b1_branch2a"
    top: "res3b1_branch2a"
    name: "res3b1_branch2a_relu"
    type: "ReLU"
}

layer {
    bottom: "res3b1_branch2a"
    top: "res3b1_branch2b"
    name: "res3b1_branch2b"
    type: "Convolution"
    convolution_param {
        num_output: 128
        kernel_size: 3
        pad: 1
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b1_branch2b"
    top: "res3b1_branch2b"
    name: "bn3b1_branch2b"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b1_branch2b"
    top: "res3b1_branch2b"
    name: "scale3b1_branch2b"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b1_branch2b"
    top: "res3b1_branch2b"
    name: "res3b1_branch2b_relu"
    type: "ReLU"
}

layer {
    bottom: "res3b1_branch2b"
    top: "res3b1_branch2c"
    name: "res3b1_branch2c"
    type: "Convolution"
    convolution_param {
        num_output: 512
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b1_branch2c"
    top: "res3b1_branch2c"
    name: "bn3b1_branch2c"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b1_branch2c"
    top: "res3b1_branch2c"
    name: "scale3b1_branch2c"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3a"
    bottom: "res3b1_branch2c"
    top: "res3b1"
    name: "res3b1"
    type: "Eltwise"
    eltwise_param {
        operation: SUM
    }
}

layer {
    bottom: "res3b1"
    top: "res3b1"
    name: "res3b1_relu"
    type: "ReLU"
}

layer {
    bottom: "res3b1"
    top: "res3b2_branch2a"
    name: "res3b2_branch2a"
    type: "Convolution"
    convolution_param {
        num_output: 128
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b2_branch2a"
    top: "res3b2_branch2a"
    name: "bn3b2_branch2a"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b2_branch2a"
    top: "res3b2_branch2a"
    name: "scale3b2_branch2a"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b2_branch2a"
    top: "res3b2_branch2a"
    name: "res3b2_branch2a_relu"
    type: "ReLU"
}

layer {
    bottom: "res3b2_branch2a"
    top: "res3b2_branch2b"
    name: "res3b2_branch2b"
    type: "Convolution"
    convolution_param {
        num_output: 128
        kernel_size: 3
        pad: 1
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b2_branch2b"
    top: "res3b2_branch2b"
    name: "bn3b2_branch2b"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b2_branch2b"
    top: "res3b2_branch2b"
    name: "scale3b2_branch2b"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b2_branch2b"
    top: "res3b2_branch2b"
    name: "res3b2_branch2b_relu"
    type: "ReLU"
}

layer {
    bottom: "res3b2_branch2b"
    top: "res3b2_branch2c"
    name: "res3b2_branch2c"
    type: "Convolution"
    convolution_param {
        num_output: 512
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b2_branch2c"
    top: "res3b2_branch2c"
    name: "bn3b2_branch2c"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b2_branch2c"
    top: "res3b2_branch2c"
    name: "scale3b2_branch2c"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b1"
    bottom: "res3b2_branch2c"
    top: "res3b2"
    name: "res3b2"
    type: "Eltwise"
    eltwise_param {
        operation: SUM
    }
}

layer {
    bottom: "res3b2"
    top: "res3b2"
    name: "res3b2_relu"
    type: "ReLU"
}

layer {
    bottom: "res3b2"
    top: "res3b3_branch2a"
    name: "res3b3_branch2a"
    type: "Convolution"
    convolution_param {
        num_output: 128
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b3_branch2a"
    top: "res3b3_branch2a"
    name: "bn3b3_branch2a"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b3_branch2a"
    top: "res3b3_branch2a"
    name: "scale3b3_branch2a"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b3_branch2a"
    top: "res3b3_branch2a"
    name: "res3b3_branch2a_relu"
    type: "ReLU"
}

layer {
    bottom: "res3b3_branch2a"
    top: "res3b3_branch2b"
    name: "res3b3_branch2b"
    type: "Convolution"
    convolution_param {
        num_output: 128
        kernel_size: 3
        pad: 1
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b3_branch2b"
    top: "res3b3_branch2b"
    name: "bn3b3_branch2b"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b3_branch2b"
    top: "res3b3_branch2b"
    name: "scale3b3_branch2b"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b3_branch2b"
    top: "res3b3_branch2b"
    name: "res3b3_branch2b_relu"
    type: "ReLU"
}

layer {
    bottom: "res3b3_branch2b"
    top: "res3b3_branch2c"
    name: "res3b3_branch2c"
    type: "Convolution"
    convolution_param {
        num_output: 512
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b3_branch2c"
    top: "res3b3_branch2c"
    name: "bn3b3_branch2c"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b3_branch2c"
    top: "res3b3_branch2c"
    name: "scale3b3_branch2c"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b2"
    bottom: "res3b3_branch2c"
    top: "res3b3"
    name: "res3b3"
    type: "Eltwise"
    eltwise_param {
        operation: SUM
    }
}

layer {
    bottom: "res3b3"
    top: "res3b3"
    name: "res3b3_relu"
    type: "ReLU"
}

layer {
    bottom: "res3b3"
    top: "res4a_branch1"
    name: "res4a_branch1"
    type: "Convolution"
    convolution_param {
        num_output: 1024
        kernel_size: 1
        pad: 0
        stride: 2
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4a_branch1"
    top: "res4a_branch1"
    name: "bn4a_branch1"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4a_branch1"
    top: "res4a_branch1"
    name: "scale4a_branch1"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res3b3"
    top: "res4a_branch2a"
    name: "res4a_branch2a"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 1
        pad: 0
        stride: 2
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4a_branch2a"
    top: "res4a_branch2a"
    name: "bn4a_branch2a"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4a_branch2a"
    top: "res4a_branch2a"
    name: "scale4a_branch2a"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4a_branch2a"
    top: "res4a_branch2a"
    name: "res4a_branch2a_relu"
    type: "ReLU"
}

layer {
    bottom: "res4a_branch2a"
    top: "res4a_branch2b"
    name: "res4a_branch2b"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 3
        pad: 1
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4a_branch2b"
    top: "res4a_branch2b"
    name: "bn4a_branch2b"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4a_branch2b"
    top: "res4a_branch2b"
    name: "scale4a_branch2b"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4a_branch2b"
    top: "res4a_branch2b"
    name: "res4a_branch2b_relu"
    type: "ReLU"
}

layer {
    bottom: "res4a_branch2b"
    top: "res4a_branch2c"
    name: "res4a_branch2c"
    type: "Convolution"
    convolution_param {
        num_output: 1024
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4a_branch2c"
    top: "res4a_branch2c"
    name: "bn4a_branch2c"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4a_branch2c"
    top: "res4a_branch2c"
    name: "scale4a_branch2c"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4a_branch1"
    bottom: "res4a_branch2c"
    top: "res4a"
    name: "res4a"
    type: "Eltwise"
    eltwise_param {
        operation: SUM
    }
}

layer {
    bottom: "res4a"
    top: "res4a"
    name: "res4a_relu"
    type: "ReLU"
}

layer {
    bottom: "res4a"
    top: "res4b1_branch2a"
    name: "res4b1_branch2a"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b1_branch2a"
    top: "res4b1_branch2a"
    name: "bn4b1_branch2a"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b1_branch2a"
    top: "res4b1_branch2a"
    name: "scale4b1_branch2a"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b1_branch2a"
    top: "res4b1_branch2a"
    name: "res4b1_branch2a_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b1_branch2a"
    top: "res4b1_branch2b"
    name: "res4b1_branch2b"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 3
        pad: 1
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b1_branch2b"
    top: "res4b1_branch2b"
    name: "bn4b1_branch2b"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b1_branch2b"
    top: "res4b1_branch2b"
    name: "scale4b1_branch2b"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b1_branch2b"
    top: "res4b1_branch2b"
    name: "res4b1_branch2b_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b1_branch2b"
    top: "res4b1_branch2c"
    name: "res4b1_branch2c"
    type: "Convolution"
    convolution_param {
        num_output: 1024
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b1_branch2c"
    top: "res4b1_branch2c"
    name: "bn4b1_branch2c"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b1_branch2c"
    top: "res4b1_branch2c"
    name: "scale4b1_branch2c"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4a"
    bottom: "res4b1_branch2c"
    top: "res4b1"
    name: "res4b1"
    type: "Eltwise"
    eltwise_param {
        operation: SUM
    }
}

layer {
    bottom: "res4b1"
    top: "res4b1"
    name: "res4b1_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b1"
    top: "res4b2_branch2a"
    name: "res4b2_branch2a"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b2_branch2a"
    top: "res4b2_branch2a"
    name: "bn4b2_branch2a"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b2_branch2a"
    top: "res4b2_branch2a"
    name: "scale4b2_branch2a"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b2_branch2a"
    top: "res4b2_branch2a"
    name: "res4b2_branch2a_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b2_branch2a"
    top: "res4b2_branch2b"
    name: "res4b2_branch2b"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 3
        pad: 1
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b2_branch2b"
    top: "res4b2_branch2b"
    name: "bn4b2_branch2b"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b2_branch2b"
    top: "res4b2_branch2b"
    name: "scale4b2_branch2b"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b2_branch2b"
    top: "res4b2_branch2b"
    name: "res4b2_branch2b_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b2_branch2b"
    top: "res4b2_branch2c"
    name: "res4b2_branch2c"
    type: "Convolution"
    convolution_param {
        num_output: 1024
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b2_branch2c"
    top: "res4b2_branch2c"
    name: "bn4b2_branch2c"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b2_branch2c"
    top: "res4b2_branch2c"
    name: "scale4b2_branch2c"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b1"
    bottom: "res4b2_branch2c"
    top: "res4b2"
    name: "res4b2"
    type: "Eltwise"
    eltwise_param {
        operation: SUM
    }
}

layer {
    bottom: "res4b2"
    top: "res4b2"
    name: "res4b2_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b2"
    top: "res4b3_branch2a"
    name: "res4b3_branch2a"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b3_branch2a"
    top: "res4b3_branch2a"
    name: "bn4b3_branch2a"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b3_branch2a"
    top: "res4b3_branch2a"
    name: "scale4b3_branch2a"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b3_branch2a"
    top: "res4b3_branch2a"
    name: "res4b3_branch2a_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b3_branch2a"
    top: "res4b3_branch2b"
    name: "res4b3_branch2b"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 3
        pad: 1
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b3_branch2b"
    top: "res4b3_branch2b"
    name: "bn4b3_branch2b"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b3_branch2b"
    top: "res4b3_branch2b"
    name: "scale4b3_branch2b"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b3_branch2b"
    top: "res4b3_branch2b"
    name: "res4b3_branch2b_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b3_branch2b"
    top: "res4b3_branch2c"
    name: "res4b3_branch2c"
    type: "Convolution"
    convolution_param {
        num_output: 1024
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b3_branch2c"
    top: "res4b3_branch2c"
    name: "bn4b3_branch2c"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b3_branch2c"
    top: "res4b3_branch2c"
    name: "scale4b3_branch2c"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b2"
    bottom: "res4b3_branch2c"
    top: "res4b3"
    name: "res4b3"
    type: "Eltwise"
    eltwise_param {
        operation: SUM
    }
}

layer {
    bottom: "res4b3"
    top: "res4b3"
    name: "res4b3_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b3"
    top: "res4b4_branch2a"
    name: "res4b4_branch2a"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b4_branch2a"
    top: "res4b4_branch2a"
    name: "bn4b4_branch2a"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b4_branch2a"
    top: "res4b4_branch2a"
    name: "scale4b4_branch2a"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b4_branch2a"
    top: "res4b4_branch2a"
    name: "res4b4_branch2a_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b4_branch2a"
    top: "res4b4_branch2b"
    name: "res4b4_branch2b"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 3
        pad: 1
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b4_branch2b"
    top: "res4b4_branch2b"
    name: "bn4b4_branch2b"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b4_branch2b"
    top: "res4b4_branch2b"
    name: "scale4b4_branch2b"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b4_branch2b"
    top: "res4b4_branch2b"
    name: "res4b4_branch2b_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b4_branch2b"
    top: "res4b4_branch2c"
    name: "res4b4_branch2c"
    type: "Convolution"
    convolution_param {
        num_output: 1024
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b4_branch2c"
    top: "res4b4_branch2c"
    name: "bn4b4_branch2c"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b4_branch2c"
    top: "res4b4_branch2c"
    name: "scale4b4_branch2c"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b3"
    bottom: "res4b4_branch2c"
    top: "res4b4"
    name: "res4b4"
    type: "Eltwise"
    eltwise_param {
        operation: SUM
    }
}

layer {
    bottom: "res4b4"
    top: "res4b4"
    name: "res4b4_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b4"
    top: "res4b5_branch2a"
    name: "res4b5_branch2a"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b5_branch2a"
    top: "res4b5_branch2a"
    name: "bn4b5_branch2a"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b5_branch2a"
    top: "res4b5_branch2a"
    name: "scale4b5_branch2a"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b5_branch2a"
    top: "res4b5_branch2a"
    name: "res4b5_branch2a_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b5_branch2a"
    top: "res4b5_branch2b"
    name: "res4b5_branch2b"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 3
        pad: 1
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b5_branch2b"
    top: "res4b5_branch2b"
    name: "bn4b5_branch2b"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b5_branch2b"
    top: "res4b5_branch2b"
    name: "scale4b5_branch2b"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b5_branch2b"
    top: "res4b5_branch2b"
    name: "res4b5_branch2b_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b5_branch2b"
    top: "res4b5_branch2c"
    name: "res4b5_branch2c"
    type: "Convolution"
    convolution_param {
        num_output: 1024
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b5_branch2c"
    top: "res4b5_branch2c"
    name: "bn4b5_branch2c"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b5_branch2c"
    top: "res4b5_branch2c"
    name: "scale4b5_branch2c"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b4"
    bottom: "res4b5_branch2c"
    top: "res4b5"
    name: "res4b5"
    type: "Eltwise"
    eltwise_param {
        operation: SUM
    }
}

layer {
    bottom: "res4b5"
    top: "res4b5"
    name: "res4b5_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b5"
    top: "res4b6_branch2a"
    name: "res4b6_branch2a"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b6_branch2a"
    top: "res4b6_branch2a"
    name: "bn4b6_branch2a"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b6_branch2a"
    top: "res4b6_branch2a"
    name: "scale4b6_branch2a"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b6_branch2a"
    top: "res4b6_branch2a"
    name: "res4b6_branch2a_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b6_branch2a"
    top: "res4b6_branch2b"
    name: "res4b6_branch2b"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 3
        pad: 1
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b6_branch2b"
    top: "res4b6_branch2b"
    name: "bn4b6_branch2b"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b6_branch2b"
    top: "res4b6_branch2b"
    name: "scale4b6_branch2b"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b6_branch2b"
    top: "res4b6_branch2b"
    name: "res4b6_branch2b_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b6_branch2b"
    top: "res4b6_branch2c"
    name: "res4b6_branch2c"
    type: "Convolution"
    convolution_param {
        num_output: 1024
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b6_branch2c"
    top: "res4b6_branch2c"
    name: "bn4b6_branch2c"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b6_branch2c"
    top: "res4b6_branch2c"
    name: "scale4b6_branch2c"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b5"
    bottom: "res4b6_branch2c"
    top: "res4b6"
    name: "res4b6"
    type: "Eltwise"
    eltwise_param {
        operation: SUM
    }
}

layer {
    bottom: "res4b6"
    top: "res4b6"
    name: "res4b6_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b6"
    top: "res4b7_branch2a"
    name: "res4b7_branch2a"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 1
        pad: 0
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b7_branch2a"
    top: "res4b7_branch2a"
    name: "bn4b7_branch2a"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b7_branch2a"
    top: "res4b7_branch2a"
    name: "scale4b7_branch2a"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b7_branch2a"
    top: "res4b7_branch2a"
    name: "res4b7_branch2a_relu"
    type: "ReLU"
}

layer {
    bottom: "res4b7_branch2a"
    top: "res4b7_branch2b"
    name: "res4b7_branch2b"
    type: "Convolution"
    convolution_param {
        num_output: 256
        kernel_size: 3
        pad: 1
        stride: 1
        weight_filler {
            type: "msra"
        }
        bias_term: false

    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b7_branch2b"
    top: "res4b7_branch2b"
    name: "bn4b7_branch2b"
    type: "BatchNorm"
    batch_norm_param {
        use_global_stats: false
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
    param {
        lr_mult: 0
    }
}

layer {
    bottom: "res4b7_branch2b"
    top: "res4b7_branch2b"
    name: "scale4b7_branch2b"
    type: "Scale"
    scale_param {
        bias_term: true
    }
    param {
